const app = getApp()
Page({

  /**
   * 页面的初始数据
   */
  data: {
    baseUrl: 'https://e-verse.wonderlord.cn:8090/mod',
    nodes: `<pre class="pre">
    <p style="text-align:center;font-weight:700;font-size:28px;">服务协议</p>
    引言

    欢迎您使用本产品小程序!

    本产品小程序(以下简称“本产品”)根据《用户服务协议》(以下简称“本协议”)为您提供服务。

为使用本产品服务，请您务必审慎阅读、充分理解本协议各条款内容，特别是免除或者限制责任的条款、对用户权利进行限制的条款等。限制、免责条款或者其他涉及您重大权益的条款可能以加粗形式提示您重点注意。

除非您已充分阅读、完全理解并接受本协议所有条款，否则您无权注册、登录或使用本产品服务。您点击“登录(具体措辞详见注册页面)”或您进行注册、使用、获取号微信手机号、登录及使用相关服务的行为或者以其他任何明示或者默示方式表示接受本协议的，均视为您已阅读并同意签署本协议。

如果您因年龄、智力等因素而不具有完全民事行为能力，请在法定监护人(以下简称"监护人")的陪同下阅读和签署本协议。

您有违反本协议的任何行为时，本产品有权根据您违反约定的情形单方采取限制、中止或终止向您提供服务等措施，并有权追究您相关责任。

一、定义与解释

如无特别说明，下列术语在本协议中的定义为:

1.1用户是指注册、登录、使用本产品的个人或组织，在本协议中更多地称为“您”。

1.2本产品小程序是用户通过手机号微信授权登陆核验，即可使用导航相关服务。(以下简称“本产品”)

1.3微信授权验证身份功能是指由公安部“互联网+”身份认证平台等机构提供的身份核验数据及技术支持。

1.4本产品账号是指您在本产品小程序通过微信获取绑定授权手机号的方式注册的，用于登录本产品小程序的账号。(以下简称“本产品账号”)

二、协议适用范围

2.1本协议是本产品制定的关于获取和使用本产品账号的相关规则。本规则适用于由本产品提供的需要注册或使用本产品账号的全部软件或服务。

2.2本协议项下的登录服务包括两种情况:本产品向用户提供的通过微信授权注册账号登录使用场景(包括微信小程序、h5或线上活动等)的服务。

2.3您通过本产品提供的账号使用相关的软件和服务时，须同时遵守各项服务的单独协议。

三、账号注册及管理

3.1账号注册

3.1.1用户可选择微信授权验证身份方式注册登录本产品账号。新用户在通过微信授权验证身份功能登录时系统将为您自动注册一个账号。

3.1.2您在注册及使用本产品服务时，必须向本产品提供真实、准确、完整、合法有效的资料，且有义务维持并及时更新您的资料。根据实名认证方式的不同，个人所需提供的微信授权实名认证资料包含但不限于姓名、身份证信息、电话号码等。若本产品有合理理由怀疑您提供的身份信息及相关资料错误、不实、过时或不完整的，本产品有权限制或停止向您提供部分或全部服务，您同时须承担因此引起的相应责任及后果。

3.1.3您不得冒用他人名义申请非本人的用户账号。如有违反，经核实后，本产品及服务平台有权删除账号。对于冒用他人名义申请非本人的用户账号而引起的一切责任，由冒用者承担。

3.1.4若您为个人用户，您确认并授权，本产品有权要求核对您的有效身份信息，并留存有效必要文件，您应积极配合，否则本产品有权限制或停止向您提供部分或全部服务。

3.2账号管理

3.2.1本产品账号的所有权归本产品所有，用户完成申请注册手续后，仅获得账号的使用权，且该使用权仅属于初始申请注册人。

3.2.2您有责任妥善保管注册账号信息的安全，您需要对您注册账号下的行为承担法律责任。当在您知悉您的账号已经失密或者可能已经失密时，您应立即通知本产品。

3.2.3您确认只有您本人可以使用您的账号。在您决定不再使用该账号时，您应向本产品申请注销该账号。您应对因您未能遵守本款约定而发生的任何损失、损毁及其他不利后果负责。

3.2.4如果您当前使用的账号并不是您初始申请注册的或者不是通过本产品提供的其他途径获得的，您不得用该号码登录或进行任何操作，并请您在第一时间通知本产品。

3.2.5如您违反相关法律法规、本规则或其他相关协议、规则，本产品有权限制、中止、冻结或终止您对账号的使用，且根据实际情况决定是否恢复您对账号的使用，而由此产生的损失由您自行承担。

四、用户个人信息保护

4.1本产品非常重视对用户个人信息的保护。本产品将按照本协议及《本产品隐私政策》的规定收集、使用、储存和分享您的个人信息。本协议对个人信息保护规定的内容与上述《本产品隐私政策》有相冲突的，及本协议对个人信息保护相关内容未作明确规定的，均应以《本产品隐私政策》的内容为准。

4.2如您认为您的个人信息被本产品超目的使用、或被其他用户侵权，请立即与本产品联系，并按照要求提供相应的证明资料，本产品将及时调查核实处理。

4.3一般情况下，你可随时浏览、修改自己提交的信息，但出于安全性和身份识别的考虑，您可能无法修改注册时提供的初始注册信息及其他验证信息。

4.4本产品将运用各种安全技术和程序建立完善的管理制度来保护您的个人信息，以免遭受未经授权的访问、使用或披露。

4.5对于本产品会如何收集、使用、存储和保护您的个人信息及您享有何种权利，您还可以阅读《隐私政策》予以进一步了解。

五、用户行为规范

5.1您不得因非正常使用服务之目的恶意注册、获取本产品账号。若经过本产品判断，认为您使用的账号是恶意注册、获取的号码，本产品有权对相应账号采取限制、中止或终止使用等措施。

5.2您在使用本服务时，须通过本产品提供的技术接口、登录页面及其他合法通道等进行平台或第三方账号和密码输入、个人信息授权等操作，否则可能会造成的账号、密码泄漏或其他损失等由您自行承担。

5.3第三方负责其提供的具体应用或其他服务的合法性、安全性以及真实性，若因任何第三方原因，造成您损失的，由第三方承担全部责任。

5.4您通过本服务使用平台或第三方账号登录、使用的应用或服务等，应遵循您与第三方之间的协议、约定或第三方相关的规则等。

5.5您在使用平台提供的服务过程中，必须遵循法律法规、规章、规范性文件及政策要求的规定，遵守所有与平台、网络服务有关的网络协议、规定和程序，并不得利用本产品从事以下行为:

(1)发布、传送、传播、储存违反国家法律、危害国家安全统一、社会稳定、公序良俗、社会公德以及侮辱、诽谤、淫秽、暴力的内容;

(2)发布、传送、传播、储存侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的内容;

(3)虚构事实、隐瞒真相以误导、欺骗他人;

(4)发表、传送、传播广告信息及垃圾信息;

(5)利用平台传输、发布违反国家法律法规政策的任何内容(信息)、涉及国家秘密和/或安全的信息、妨碍互联网运行安全的信息;侵害他人合法权益的信息和/或其他有损于社会秩序、社会治安、公共道德的信息或内容、任何骚扰性的、中伤他人的、辱骂性的、恐吓性的、庸俗淫秽的或其他任何非法的信息资料等，且不得为他人实施上述行为提供任何便利;

(6)以任何技术手段或其他方式干扰平台及政府各部门等面向公众的网上服务系统的正常运行或干扰其他用户对平台服务的使用;

(7)通过任何方式搜集本产品服务中其他用户的用户名、电子邮件等相关信息，并以发送垃圾邮件、连锁邮件、垃圾短信、即时消息等方式干扰、骚扰其他用户;

(8)从事其他违反法律法规、政策及公序良俗、社会公德等的行为或对互联网的正常运转造成不利影响的行为。

5.6本产品服务仅供您个人使用，除非经本产品书面许可，您不得进行以下行为:

(1)通过本产品发布包含广告、宣传、促销等内容的信息;

(2)将本产品提供的服务再次许可他人使用;

(3)其他超出本产品正常服务功能之外的行为。

5.7您充分了解并同意，您必须为自己注册账号下的一切行为负责，包括您所发表的任何内容、您进行的各项操作、您进行的授权以及由此产生的任何后果。

5.8如果本产品发现或收到他人举报您发布的信息违反前述约定或本协议其他约定的，本产品有权进行独立判断并采取技术手段予以删除、屏蔽或断开相关的信息链接。同时，本产品有权视您的行为性质，采取包括但不限于暂停或终止本服务、追究法律责任等措施。本产品有权判断用户的行为是否符合平台服务条款规定的权利，如果本产品认为用户违背了本协议、法律法规政策等规定，本产品有权随时变更、中断或终止部分或全部服务的权利，且无需事先告知。

六、知识产权声明

6.1本产品在服务中提供的任何软件、网站、商业标识、版面设计、排版方式、文字、图片、图形、音频、视频、有关数据等内容、功能和服务的著作权、商标权、专利权、商业秘密等知识产权均受中华人民共和国法律法规和相应的国际条约保护，本产品所有者或技术支持方享有上述知识产权，但相关权利人依照法律规定应享有的权利除外。

6.2您在使用本产品的过程中，可能会使用到由第三方开发的在本产品运行的功能、软件或服务，用户除遵守本协议相关规定以外，还应遵守第三方相关规定，并尊重第三方权利人对其功能、软件、服务及其所包含内容的相关权利。

6.3未经本产品或相关权利人书面同意，您不得为任何商业或非商业目的自行或许可任何第三方实施、利用、转让上述知识产权。

七、第三方提供的服务

7.1本服务可能会使用第三方软件或技术，这种使用已经获得合法授权，您对本协议的签署及继续使用行为视为对接受第三方软件或技术服务的认可。

7.2如因本产品使用的第三方软件或技术引发的任何纠纷，应由该第三方负责解决，您使用本产品上提供的产品或服务时，除遵守本协议约定外，还应遵守第三方的服务或用户协议。本产品和第三方之间对出现的纠纷在法律规定和约定的范围内各自承担责任。

八、风险及免责

8.1您理解并同意:为了向您提供有效的服务，本服务会利用您终端设备的处理器和带宽等资源。在使用本产品过程中可能产生数据流量的费用，您需自行向运营商了解相关资费信息，并自行承担相关费用。

8.2您在使用本产品提供的服务时，须自行承担如下本产品不可掌控的风险内容，包括但不限于:

(1)本产品系统停机维护期间;

(2)电信设备出现故障不能进行数据传输的;

(3)由于网络供应商技术调整或故障、应用升级的问题等原因而造成的服务中断或延迟;

(4)用户的系统、硬件和通信线路出现故障;

(5)用户操作不当或通过非本产品授权的方式使用本服务;

(6)因受到计算机病毒、木马或其他恶意程序、黑客攻击的破坏、台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素，造成系统障碍不能执行业务的。

(7)其他本产品无法控制或合理预见的情形。

8.3因您的过错导致的任何损失由您自行承担，该过错包括但不限于:不按照提示操作，未及时进行操作，遗忘或泄漏密码、校验码等，密码被他人破解，您使用的计算机或其他硬件、终端等被他人侵入或丢失，或您使用的软件被他人侵入，或者您的个人生物识别信息被他人利用。

8.4您理解并同意，因业务发展需要，本产品有权在提前告知的前提下，对本产品的全部或部分服务内容进行变更、暂停、限制、终止或撤销，用户需承担此风险。

8.5本产品会根据您选择的服务类型向您提供相应的服务。您理解并同意，本产品有权选择提供服务或开展合作的对象，有权决定功能开放、数据接口和相关数据披露的对象和范围，并有权视具体情况中止或终止向存有包括但不限于以下情形的用户提供本服务:

(1)违反法律法规或本协议规定的;

(2)影响使用者体验的;

(3)存在安全隐患的;

(4)违背本服务运营原则，或不符合本产品其他管理要求的。

九、法律责任

9.1您理解并同意，本产品有权依合理判断对违反有关法律法规或本协议规定的行为追究责任，对违法违规的任何人士采取适当的法律行动，并依据法律法规保存有关信息向有关部门]报告等，您应独自承担由此而产生的一切法律责任。

9.2您理解并同意，因您违反本协议或相关服务条款的规定，导致或产生第三方主张的任何索赔、要求或损失，您应当独立承担责任;本产品因此遭受损失的，您也应当一并赔偿。

9.3您理解并同意，您可向本产品进行的任何索赔均限于已经发生的直接损失。

十、协议的更新、变更

10.1协议的更新

本协议内容同时包括本产品可能不定期发布的关于本服务的相关协议、服务声明、业务规则及公告指引等内容。上述内容一经正式发布，即为本协议不可分割的组成部分，请同样遵守。否则，请立即停止使用本服务。

10.2协议的变更

您使用本服务即视为您已阅读并同意受本协议的约束。本产品有权在必要时修改本协议条款。您在享受各项服务时，可以在相关页面中查阅最新的协议条款。本协议条款变更后，如果您继续使用本服务，即视为您已接受修改后的协议。如果您不接受修改后的协议，应当停止使用本服务，注销平台账号、停止使用本服务。

10.3协议的签署形式

如您对本协议条款内容有任何疑问，可向平台客服咨询。一旦点击“同意”或“接受”或“注册”按钮并成功注册，则与本产品之间形成协议关系，应当受本协议条款的约束。

十一、法律适用及管辖

11.1本协议的签订地为甘肃省。

11.2本协议的订立、变更、执行和解释，以及与本协议有关的争议解决，均应适用中华人民共和国法律。如与本协议有关的某特定事项没有法律规定或规定不明确，则应参照通用的国际商业惯例和行业惯例。

11.3如因本协议或本服务所引起或与其有关的任何争议应向本地仲裁委员会提起仲裁。

十二、通知与送达

12.1所有发给您的通知都可通过您在平台预留的通讯方式，以电子邮件、常规的信件或在网站显著位置公告的等方式进行传送。平台将通过上述方法之一将消息传递给您，告知您服务条款的修改、服务变更、或其它重要事情。

12.2您应当保证和维持资料的有效性，您的资料若存在虚假、无效等任何可能导致您无法及时获取业务通知、客户服务、投诉处理、纠纷协调、技术支持等情况的，由您自行承担相应责任。

12.3本产品可以不定期以网页公告、电子邮件、手机短信、站内信、即时通讯工具等方式中的一种或多种向您发送与本服务有关的业务通知、服务提示、验证消息等各种业务通知。

12.4各方均应保证其联系方式真实、有效，通知自发送之日视为已送达收件人。

十三、其他

13.1本协议自您同意勾选并成功注册为本产品用户之日起生效，除非本产品终止本协议或者您丧失本产品用户资格，否则本协议始终有效。本协议终止并不免除用户根据本协议或其他有关协议、规则所应承担的义务和责任。

13.2本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效,对双方具有约束力。
</pre>`
  }
})